export default function ChallengeStar (graphdata: any, xAxis: number) {
    let data = graphdata.series3[xAxis];
    let data_1 = graphdata.series3[xAxis + 1];
    let slope = graphdata.slopeSeries3[xAxis].slope;
    let wording;
    let description;
    let subWording;
    if (data >= -Math.floor((100*Math.sin(Math.PI/6))) && data <= 0){
        if ((slope >= 0)){
            wording = 'ช่วงท้าทายด้านสุขภาพและงานประจำ';
            subWording = 'ตกด้านสุขภาพและงานประจำ';
            description = 'เป็นช่วงที่เหมาะแก่การกลับมาใส่ใจ ดูแลสุขภาพกายและใจอย่างสม่ำเสมอ พัฒนาการทำงานให้เป็นระบบ อาจมีอุปสรรคในการทำงาน ทำให้เกิดความเครียด ความรู้สึกเหนื่อยล้า แต่นี่เป็นโอกาสในฝึกบริหารจัดการงานและชีวิตให้สมดุลขึ้น';
        } else if ((slope <= 0)){
            wording = 'ช่วงท้าทายด้านรูปลักษณ์และตัวตน';
            subWording = 'ตกด้านรูปลักษณ์และตัวตน'
            description = 'เป็นช่วงที่เหมาะสำหรับการเติบโตภายในตัวเอง อาจรู้สึกว่ามีแรงกดดันให้ต้องพัฒนา แต่จริง ๆ แล้วนี่คือโอกาสที่จะได้เรียนรู้วิธีสร้างความมั่นใจและพัฒนาบุคลิกภาพของตัวเองอย่างมั่นคง หากรู้เท่าทันความคิดลบ ความเครียด ความไม่มั่นใจในตัวเองได้ ช่วงนี้จะช่วยให้ได้สำรวจและพัฒนาตัวเองได้อย่างเข้มข้นเลย';
        }
        
    } else if (data >= -Math.floor((100*Math.sin(Math.PI/3))) && data < -Math.floor((100*Math.sin(Math.PI/6)))){
        if ((slope >= 0)){
            wording = 'ช่วงท้าทายด้านความรักและการสร้างสรรค์';
            subWording = 'ตกด้านความรักและการสร้างสรรค์'
            description = 'เป็นช่วงที่เหมาะแก่การพัฒนาความสัมพันธ์ให้ลึกซึ้ง ผ่านอุปสรรคต่าง ๆ หรืออาจรู้สึกกดดันหรือมีข้อจำกัดในการสร้างสรรค์ผลงาน ที่ต้องใช้ความพยายามและความอดทน อาจต้องใช้ความพยายามมากขึ้นในสิ่งที่รัก แต่จะได้พบว่าผลลัพธ์ที่ได้เป็นสิ่งที่มีคุณค่าและยั่งยืน';
       } else if ((slope <= 0)) {
            wording = 'ช่วงท้าทายด้านทรัพย์สินและคุณค่า';
            subWording = 'ตกด้านทรัพย์สินและคุณค่า'
            description = 'เป็นช่วงที่เหมาะสำหรับการกลับมาดูแลเรื่องการเงินของตัวเอง ให้มีความชัดเจน มีความรอบคอบเและจัดการเงินให้ดีขึ้น หลีกเลี่ยงการใช้จ่ายเกินตัว เป็นโอกาสอันดีในการสร้างนิสัยทางการเงินที่มั่นคง';
        }
        
    } else if (data >= -100 && data < -Math.floor((100*Math.sin(Math.PI/3)))){
        if ((slope >= 0)){
            wording = 'ช่วงท้าทายด้านบ้านและครอบครัว';
            subWording = 'ตกด้านบ้านและครอบครัว'
            description = 'เป็นช่วงที่เหมาะแก่การกลับมาใส่ใจครอบครัวและบ้านที่อยู่อาศัย อาจรู้สึกหนักใจที่ต้องรับผิดชอบ รับมือปัญหาหรือต้องดูแลคนในครอบครัว เป็นช่วงที่ควรสร้างความมั่นคงในชีวิตครอบครัวและรับมือกับการเปลี่ยนแปลงที่อาจเกิดขึ้น แต่ก็ถือว่าเป็นโอกาสที่ดีในการสร้างความมั่นคงและความสัมพันธ์ที่แน่นแฟ้นขึ้นในครอบครัว';
        } else if ((slope <= 0)) {
            wording = 'ช่วงท้าทายด้านการสื่อสารและการเรียนรู้';
            subWording = 'ตกด้านการสื่อสารและการเรียนรู้'
            description = 'เป็นช่วงที่เหมาะแก่การทบทวนและกลับมาใส่ใจคำพูดและการสื่อสารของตัวเองให้รอบครอบมากขึ้น การสื่อสารอาจติดขัดหรือไม่ราบรื่น ต้องระวังความเข้าใจผิดและการสื่อสารที่ไม่ชัดเจนที่อาจก่อให้เกิดความขัดแย้ง แต่นี่คือโอกาสในการพัฒนาให้สื่อสารอย่างมีประสิทธิภาพมากขึ้น';
        }
        
    } else if (data >= 0 && data < Math.floor((100*Math.sin(Math.PI/6)))){
        if ((slope >= 0)){
            wording = 'ช่วงท้าทายด้านการแต่งงานและพาร์ทเนอร์';
            subWording = 'ตกด้านการแต่งงานและพาร์ทเนอร์';
            description = 'เป็นช่วงที่เหมาะแก่การกลับมาใส่ใจเรื่องความสัมพันธ์ในระยะยาว ความสัมพันธ์ในชีวิตคู่หรือการร่วมงานกับคนอื่นอาจมีความท้าทายหรือรู้สึกถึงข้อจำกัด ระวังความตึงเครียดและการแยกตัวออกจากกัน แต่ถ้าผ่านช่วงเวลานี้ไปได้จจะเป็นโอกาสในการสร้างความสัมพันธ์ที่มีพื้นฐานที่แข็งแกร่งและยั่งยืนมากยิ่งขึ้นกว่าเดิม';
        } else if ((slope <= 0)) {
            wording = 'ช่วงท้าทายด้านจิตวิญญาณ';
            subWording = 'ตกด้านจิตวิญญาณ'
            description = 'เป็นช่วงที่เหมาะแก่การสำรวจด้านในตัวเอง เป็นโอกาสในการเรียนรู้และพัฒนาจิตวิญญาณให้ลึกซึ้งขึ้น ระวังความรู้สึกโดดเดี่ยว ปัญหาภายในจิตใจ เพชิญกับอะไรบางอย่างที่ยังติดอยู่ข้างในใจ อาจต้องใช้เวลามากขึ้นกับตัวเอง แต่สิ่งนี้จะช่วยให้คุณพบความสงบและเข้าใจความหมายของชีวิตในระดับที่ลึกซึ้งขึ้น';
        }
        
    } else if (data >= Math.floor((100*Math.sin(Math.PI/6))) && data < Math.floor((100*Math.sin(Math.PI/3)))){
        if ((slope >= 0)){
            wording = 'ช่วงท้าทายด้านการเปลี่ยนแปลง';
            subWording = 'ตกด้านการเปลี่ยนแปลง';
            description = 'เป็นช่วงที่เหมาะกับการปรับตัวให้เข้ากับการเปลี่ยนแปลงในชีวิต เปิดรับการเปลี่ยนแปลงและเรียนรู้วิธีการจัดการกับสิ่งใหม่ ๆ ที่เข้ามา อาจเกิดการเปลี่ยนแปลงที่ไม่คาดคิดครั้งใหญ่ในชีวิต รวมถึงการจัดการหนี้สินหรือเรื่องการเงินของผู้อื่น  ควรรับมือกับความสูญเสียและเตรียมพร้อมรับความเปลี่ยนแปลง เป็นช่วงที่ถ้าผ่านไปได้จะเสริมสร้างความแข็งแกร่งทางจิตใจ';
        } else if ((slope <= 0)) {
            wording = 'ช่วงท้าทายด้านความฝันและความสัมพันธ์กับผู้คน';
            subWording = 'ตกด้านความฝันและความสัมพันธ์กับผู้คน';
            description = 'เป็นช่วงที่เหมาะแก่การทบทวนความสัมพันธ์ เลือกอยู่กับกลุ่มคนที่เข้ากันได้จริง ๆ  ระวังการแยกตัวออกจากลุ่มเพื่อนฝูงหรือขาดการติดต่อกับกลุ่มคนที่ทำงานด้วย อาจพบว่าความฝันบางอย่างต้องใช้เวลาและความพยายามมากขึ้น หมั่นติดต่อกับกลุ่มคนที่เราแคร์ และพัฒนาความสัมพันธ์ที่มีให้ไปสนับสนุนและเสริมสร้างความฝันของเราได้';
        }
        
    } else if (data >= Math.floor((100*Math.sin(Math.PI/3))) && data <= 100){
        if ( (slope >= 0)){
            wording = 'ช่วงท้าทายด้านปรัชญาและการเดินทางไกล';
            subWording = 'ตกด้านปรัชญาและการเดินทางไกล';
            description = 'เป็นช่วงที่เหมาะแก่พิจารณาเป้าหมายให้ชัดเจนในระยะยาว ระวังความล่าช้าหรือปัญหาในการเดินทางไกล ขีดจำกัดที่ต้องขยายขอบเขตความคิดและการเรียนรู้เชิงปรัชญา  อาจต้องตั้งเป้าหมายใหม่ในแนวทางที่ต้องการจะเดินให้มีความมั่นคงและเป็นจริง แต่ก็เป็นการเปิดโอกาสในการวางแผนระยะยาวที่มั่นคงยิ่งขึ้น';
        } else if ( (slope <= 0)) {
            wording = 'ช่วงท้าทายด้านชื่อเสียงและอาชีพการงาน';
            subWording = 'ตกด้านชื่อเสียงและอาชีพการงาน';
            description = 'เป็นช่วงที่เหมาะกับการสร้างรากฐานที่มั่นคงในอาชีพ อาจต้องทำงานหนักขึ้น รับผิดชอบมากขึ้น ท้าทายขึ้น มีความกดดัน แต่ถ้าผ่านไปได้จะนำพาความมั่นคงและโอกาสในการพัฒนาชื่อเสียง ความสำเร็จในสายงาน';
        }
        
    }
    return {wording, description, subWording};
}