export default function LuckStar (graphdata: any, xAxis: number) {
    let data = graphdata.series2[xAxis];
    let data_1 = graphdata.series2[xAxis + 1];
    let slope = graphdata.slopeSeries2[xAxis].slope;
    console.log(`Luck Slope: ${slope}`)
    let wording;
    let description;
    console.log(`Luck Now: ${data}`);
    console.log(`Luck Next: ${data_1}`);
    if (data >= -Math.floor((50*Math.sin(Math.PI/6))) && data <= 0){
        if ((slope >= 0)){
            wording = 'ช่วงมีโชคด้านสุขภาพและงานประจำ';
            description = 'เป็นช่วงที่สุขภาพแข็งแรงและมีโอกาสก้าวหน้าทางการงาน เหมาะกับการเริ่มงานใหม่ การดูแลสุขภาพ และการปรับปรุงวิธีการทำงานให้มีประสิทธิภาพยิ่งขึ้น';
        } else if ((slope <= 0)){
            wording = 'ช่วงมีโชคด้านรูปลักษณ์และตัวตน';
            description = 'เป็นช่วงที่เหมาะแก่การเสริมเสน่ห์ เพิ่มความมั่นใจในตัวเอง หาตัวตนหรือ Vibe ของเรา เร่ิมต้นสิ่งใหม่ ๆ ทั้งในเรื่องชีวิตส่วนตัวและอาชีพการงาน เช่นเริ่มต้นโครงการใหม่ หรือเริ่มพัฒนาตัวเอง';
        }
        
    } else if (data >= -Math.floor((50*Math.sin(Math.PI/3))) && data < -Math.floor((50*Math.sin(Math.PI/6)))){
        if ((slope >= 0)){
            wording = 'ช่วงมีโชคด้านความรักและการสร้างสรรค์';
            description = 'เป็นช่วงที่มีความสุขและความสำเร็จในเรื่องความรัก การมีลูก ความสนุก การสร้างสรรค์ ศิลปะ ความเป็นเด็กในตัวเรา เหมาะสำหรับการสร้างสรรค์ผลงาน การทำกิจกรรมที่เกี่ยวข้องกับเด็ก ๆ และการพัฒนาความสัมพันธ์ที่โรแมนติก';
        } else if ((slope <= 0)) {
            wording = 'ช่วงมีโชคด้านทรัพย์สินและคุณค่า';
            description = 'เป็นช่วงที่เหมาะแก่การศึกษาเรื่องการลงทุน ซื้อขายทรัยพ์สิน ขยายธุรกิจ เพิ่มความมั่งคั่งให้กับตัวเอง';
        }
        
    } else if (data >= -50 && data < -Math.floor((50*Math.sin(Math.PI/3)))){
        if ((slope >= 0)){
            wording = 'ช่วงมีโชคด้านบ้านและครอบครัว';
            description = 'เป็นช่วงที่เหมาะแก่การดูแลที่อยู่อาศัย ปรับปรุงบ้านหรือขยาย กลับไปใช้เวลาร่วมกับครอบครัว ลงทุนในอสังหาริมทรัพย์ คนในครอบครัว บรรพบุรุษอาจนำโชคมาให้';
        } else if ((slope <= 0)) {
            wording = 'ช่วงมีโชคด้านการสื่อสารและการเรียนรู้';
            description = 'เป็นช่วงที่เหมาะกับการเขียน การพูด การสอน หรือทำธุรกิจที่เกี่ยวข้องกับการสื่อสาร ให้ความรู้ เป็นช่วงที่มีโชคในการเดินทางสั้น ๆ หรือจากคนใกล้ตัวที่ให้ความรู้เรา อย่างคุณครู ญาติพี่น้อง';
        }
        
    } else if (data >= 0 && data < Math.floor((50*Math.sin(Math.PI/6)))){
        if ((slope >= 0)){
            wording = 'ช่วงมีโชคด้านการแต่งงานและพาร์ทเนอร์';
            description = 'เป็นช่วงที่โชคดีในเรื่องคู่ครองและความสัมพันธ์ มีโอกาสกระชับความสัมพันธ์หรือแต่งงาน หรือถ้าทำธุรกิจก็เหมาะกับการทำธุรกิจที่เกี่ยวข้องกับการสร้างพันธมิตรหรือการมีพาร์ทเนอร์ความร่วมมือระยะยาว';
        } else if ((slope <= 0)) {
            wording = 'ช่วงมีโชคด้านจิตวิญญาณ';
            description = 'เป็นช่วงที่ทบทวนตัวเองได้ดี เหมาะกับการใช้เวลาทำสมาธิ การปลีกตัวเพื่อพัฒนาจิตวิญญาณ และทำงานเบื้องหลัง สะสมประสบการณ์ เพื่อประสบความสำเร็จในอนาคต';
        }
        
    } else if (data >= Math.floor((50*Math.sin(Math.PI/6))) && data < Math.floor((50*Math.sin(Math.PI/3)))){
        if ((slope >= 0)){
            wording = 'ช่วงมีโชคด้านการเปลี่ยนแปลง';
            description = 'เป็นช่วงที่โชคดีในเรื่องส่งเสริมการเปลี่ยนแปลงและการเกิดใหม่ในชีวิต โชคลาภอาจมาจากมรดกหรือทรัพย์สินของคนอื่น เหมาะกับการปรับเปลี่ยนทิศทางชีวิตและการลงทุนร่วมกับผู้อื่น';
        } else if ((slope <= 0)) {
            wording = 'ช่วงมีโชคด้านความฝันและความสัมพันธ์กับผู้คน';
            description = 'เป็นช่วงที่ทำงานร่วมกับผู้อื่นได้ดี รายล้อมไปด้วยผู้คน เพื่อน มิตรภาพ และการทำงานร่วมกับกลุ่มคนที่มีเป้าหมายเดียวกัน เหมาะกับการร่วมมือกับเพื่อนร่วมงาน หรือรวมตัวคนที่มีความฝันร่วมกัน';
        }
        
    } else if (data >= Math.floor((50*Math.sin(Math.PI/3))) && data <= 50){
        if ((slope >= 0)){
            wording = 'ช่วงมีโชคด้านปรัชญาและการเดินทางไกล';
            description = 'เป็นช่วงที่เดินทางไกลแล้วดี เหมาะกับการศึกษาต่อในระดับที่สูงขึ้น การเรียนรู้ปรัชญา ศาสนา หรือการเดินทางไกลเพื่อค้นหาความรู้และประสบการณ์ใหม่ ๆ';
        } else if ((slope <= 0)) {
            wording = 'ช่วงมีโชคด้านชื่อเสียงและอาชีพการงาน';
            description = 'เป็นช่วงที่มีโชค ความสำเร็จและชื่อเสียงในหน้าที่การงาน เหมาะกับการขยายกิจการ การก้าวหน้าในอาชีพ หรือการรับบทบาทผู้นำในองค์กร';
        }
        
    }
    return {wording, description};
}